docs/leets/0015-3Sum.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2024-08-02 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>0015. 3Sum</title>
<meta name="author" content="d)zharii" />
<meta name="generator" content="Org Mode" />
<meta name="viewport" content="width=device-width, initial-scale=1.0">
<link rel="stylesheet" href="/static/t.css"/>
</head>
<body>
<nav><a href="/" tabindex="0">&larrhk; Back to Index</a></nav><div id="preamble" class="status">
Published 2024-07-02
</div>
<div id="content" class="content">
<header>
<h1 class="title">0015. 3Sum</h1>
<p class="subtitle" role="doc-subtitle">leetcode</p>
</header><nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgd542da0">Problem:</a>
<ul>
<li><a href="#org10fccf1">Solution Description:</a></li>
</ul>
</li>
<li><a href="#org6ece4a9">Note:-</a>
<ul>
<li><a href="#orgc975a2a">Example:</a></li>
<li><a href="#org16c0c19">Setup:</a></li>
</ul>
</li>
</ul>
</div>
</nav>

<div id="outline-container-orgd542da0" class="outline-2">
<h2 id="orgd542da0">Problem:</h2>
<div class="outline-text-2" id="text-orgd542da0">
<p>
Find all unique triplets in the array which gives the sum of zero. The solution set must not contain duplicate triplets.
</p>
</div>

<div id="outline-container-org10fccf1" class="outline-3">
<h3 id="org10fccf1">Solution Description:</h3>
<div class="outline-text-3" id="text-org10fccf1">
<p>
To implement a solution for the 3Sum problem, we need to:
</p>
<ol class="org-ol">
<li>Sort the array to enable the two-pointer approach for finding triplets.</li>
<li>Iterate through the array with the first pointer, and for each element, use two additional pointers (one starting just after the first pointer, and the other starting from the end of the array) to find pairs that sum up to the negative value of the current element.</li>
<li>If the sum of the triplet (current element and the values pointed by the two pointers) is zero, then it's a valid triplet.</li>
<li>Move the pointers closer to skip duplicate elements and continue the search.</li>
<li>Continue the iteration until all triplets are found.</li>
<li>Return the list of unique triplets.</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-org6ece4a9" class="outline-2">
<h2 id="org6ece4a9">Note:-</h2>
<div class="outline-text-2" id="text-org6ece4a9">
<p>
Time Complexity: O(n<sup>2</sup>) – Sorting the array takes O(n log n) time and the two-pointer strategy takes O(n) time for each element, resulting in O(n<sup>2</sup>) overall.
Space Complexity: O(1) – aside from the space required for the output list, the solution uses a constant amount of space.
</p>
</div>

<div id="outline-container-orgc975a2a" class="outline-3">
<h3 id="orgc975a2a">Example:</h3>
<div class="outline-text-3" id="text-orgc975a2a">
<p>
Given array nums = [-1, 0, 1, 2, -1, -4],
A solution set is: [[-1, 0, 1], [-1, -1, 2]]
The algorithm starts by sorting the array: [-4, -1, -1, 0, 1, 2]
</p>
<ul class="org-ul">
<li>For the first element (-4), the remaining array is [-1, -1, 0, 1, 2]
<ul class="org-ul">
<li>Using two pointers, we don't find any triplet that sums to zero</li>
</ul></li>
<li>For the second element (-1), the remaining array is [-1, 0, 1, 2]
<ul class="org-ul">
<li>We find triplets: [-1, -1, 2] and [-1, 0, 1]</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org16c0c19" class="outline-3">
<h3 id="org16c0c19">Setup:</h3>
<div class="outline-text-3" id="text-org16c0c19">
<p>
Here is the general framework in which we will plug our code blocks. We will use modern JavaScript and include a testing setup to verify our solution.
</p>

<div class="org-src-container">
<pre class="src src-js">// Helper definitions to setup logging for testing.

/**
 * Main function to find all unique triplets in the array that sum to zero.
 * @param {number[]} nums
 * @returns {number[][]} - Array of arrays containing unique triplets
 */
function threeSum(nums) {
    const log = typeof NestedInteger !== 'undefined' ? () =&gt; {} : console.log;
    const table = typeof NestedInteger !== 'undefined' ? () =&gt; {} : console.table;

    nums = nums.sort((a, b) =&gt; a - b);

    log("A", JSON.stringify(nums));

    if (nums.length &lt; 3) return [];
    if (nums[0] === 0 &amp;&amp; nums[0] === nums[nums.length - 1]) return [[0, 0, 0]];

    const result = [];

    for (let i = 0; i &lt; nums.length - 2; i += 1) {
        // Skip duplicates for the current element
        if (i &gt; 0 &amp;&amp; nums[i] === nums[i - 1]) continue;

        const a = nums[i];
        let j = i + 1;
        let k = nums.length - 1;

        while (j &lt; k) {
            const b = nums[j];
            const c = nums[k];
            const tsum = a + b + c;

            log('c', `i = ${i}; j = ${j}; k = ${k}`);
            log('d', `a = ${a}; b = ${b}; c = ${c}`);
            log('e', `tsum = ${tsum}`);

            if (tsum === 0) {
                result.push([a, b, c]);

                while (j &lt; k &amp;&amp; nums[j] === b) j += 1;
                while (j &lt; k &amp;&amp; nums[k] === c) k -= 1;
            } else if (tsum &lt; 0) {
                j += 1;
            } else {
                k -= 1;
            }
            log('=======');
        }
    }

    return result;
}

// Test cases to validate our solution.
const testCases = [
    { nums: [3,0,-2,-1,1,2], expected: [[-2,-1,3],[-2,0,2],[-1,0,1]] },
    { nums: [-1, 0, 1, 2, -1, -4], expected: [[-1, 0, 1], [-1, -1, 2]] },
    { nums: [], expected: [] },
    { nums: [0], expected: [] },
    { nums: [0, 0, 0], expected: [[0, 0, 0]] },
    { nums: [-2, 0, 0, 2, 2], expected: [[-2, 0, 2]] },
    // Additional edge case where we have multiple triplet combinations
    { nums: [-4, -1, -1, 0, 1, 2], expected: [[-1, -1, 2], [-1, 0, 1]] }
];

// Execute the test cases to verify the solution.
testCases.forEach((test, index) =&gt; {
    const result = threeSum(test.nums);
    console.log(`Test Case ${index + 1}: ${JSON.stringify(result) === JSON.stringify(test.expected) ? 'Passed' : 'Failed'} (Expected: ${JSON.stringify(test.expected)}, Got: ${JSON.stringify(result)})`);
});
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
&copy; d)zharii. <a href="/sitemap.html">sitemap</a>
</div>
</body>
</html>
